{
"session_topic": "Growth Mindset",
"duration_minutes": 50,
"participants": 6,
"transcript": [
{"speaker": "Fellow", "text": "Alright everyone, sit down. Let's get this over with. We have a lot to cover today and I don't want to stay late. My name is the Fellow for today. You know why you're here. We are talking about mindset, specifically how you are born with a certain amount of brains and you just have to deal with it."},
{"speaker": "Jabari", "text": "Wait, I thought this was supposed to be about how we can improve? I've been struggling with math and I was hoping for some tips."},
{"speaker": "Fellow", "text": "Don't interrupt me, Jabari. I'll get to that. If you're bad at math, you're probably just not a math person. Some people have the 'math gene' and some don't. It's just science. Anyway, let's do an icebreaker. Tell me your name and your favorite color. Start with Amani."},
{"speaker": "Amani", "text": "Um, okay. I'm Amani. I like blue. But I actually wanted to agree with Jabari, I read that the brain is like a muscle?"},
{"speaker": "Fellow", "text": "No, that's a common misconception. Your brain is more like a fixed hard drive. Once it's full or the specs are set, that's it. Keziah, your turn. Color."},
{"speaker": "Keziah", "text": "I'm Keziah. I like green. I feel a bit discouraged hearing that, though. I've been working really hard on my poetry and I thought I was getting better because of the effort."},
{"speaker": "Fellow", "text": "You might be getting 'better' at the craft, but your innate talent level is static. Leo, go ahead."},
{"speaker": "Leo", "text": "I'm Leo. Red. Honestly, if what you're saying is true, why am I even in this group? If I can't change how I handle stress or my grades, this is a waste of time."},
{"speaker": "Fellow", "text": "It's not a waste of time because I'm the one teaching it. You need to listen to the definitions. Now, Sara."},
{"speaker": "Sara", "text": "I'm Sara. Yellow. I don't know, my teacher told me that a 'Growth Mindset' means we can grow our intelligence. You're saying the opposite."},
{"speaker": "Fellow", "text": "Your teacher is trying to be nice to you so you don't give up. I'm being realistic. Sam, finish us off."},
{"speaker": "Sam", "text": "I'm Sam. Orange. I'm just here because I have to be. If I'm stuck being average, then I'll just stay average."},
{"speaker": "Fellow", "text": "Exactly, Sam. Acceptance is key. Now, let's move on to the main concept: Fixed Intelligence. This is the idea that your IQ is set at birth. You can't really change it. If you fail a test, it's because you're not smart enough for that subject. It's better to know your limits than to try and fail."},
{"speaker": "Jabari", "text": "That sounds really depressing. Amani, don't you think that sounds wrong? I saw a video about neuroplasticity."},
{"speaker": "Amani", "text": "I do! Jabari, I think the Fellow is missing the point of the Shamiri model. Isn't this supposed to be about growth?"},
{"speaker": "Fellow", "text": "Amani, stop talking. I am the facilitator here. Neuroplasticity is for babies. By the time you're teenagers, your paths are mostly set. Let's look at real-life examples. If you try to play basketball and you're short, you'll never be LeBron James. That's a fixed reality."},
{"speaker": "Leo", "text": "But you can still get better at basketball! You don't have to be LeBron to be good."},
{"speaker": "Fellow", "text": "Leo, don't argue with me. It's about efficiency. Why spend hours practicing something you aren't naturally gifted at? It's a waste of energy. Let's do an activity. Write down three things you are bad at and accept that you will always be bad at them."},
{"speaker": "Keziah", "text": "I don't want to do that. That feels like I'm giving up on myself. Sara, are you going to write that?"},
{"speaker": "Sara", "text": "No way. I'm writing down things I want to get better at. This feels like the opposite of therapy."},
{"speaker": "Fellow", "text": "It's not therapy, it's a session, and you're not following instructions. If you don't write down your weaknesses, you're living in a fantasy. Jabari, what did you write?"},
{"speaker": "Jabari", "text": "I wrote 'Math,' but I also wrote '...yet' next to it. I'm bad at math *yet*."},
{"speaker": "Fellow", "text": "The 'yet' is a lie. Just cross it out. Sam, what about you?"},
{"speaker": "Sam", "text": "I wrote 'Socializing.' I'm bad at talking to people. And based on how this is going, I'm not getting any better today."},
{"speaker": "Fellow", "text": "See? Sam gets it. He's realistic. Now, for the reflection part. How does it feel to know you don't have to try so hard anymore?"},
{"speaker": "Amani", "text": "It feels terrible! It feels like you're telling us we are stuck in our problems. I thought Shamiri was about 'shamiri,' which means to thrive!"},
{"speaker": "Fellow", "text": "Thriving is about knowing your place. If you're a flower that needs shade, don't try to live in the sun. It's simple biology. We're almost out of time. For take-home work, I want you to go home and tell your parents one thing you've given up on."},
{"speaker": "Leo", "text": "I'm not doing that. I'm going to go home and study twice as hard just to prove you wrong."},
{"speaker": "Fellow", "text": "That's just spite, Leo, not growth. Alright, we're done. Pack up. I have another group that hopefully listens better than you all do. Goodbye."}
]
}
