{
"session_topic": "Growth Mindset",
"duration_minutes": 50,
"participants": 6,
"transcript": [
{"speaker": "Fellow", "text": "Alright everyone, welcome back! It’s so good to see all six of you here today. I know the sun is out and you probably have a million other things you could be doing, but I really appreciate you showing up for our second Shamiri session. How is everyone feeling today? Just a quick one-word check-in."},
{"speaker": "Jabari", "text": "Tired. Definitely tired. We had football practice early this morning and my legs are basically jelly right now."},
{"speaker": "Amani", "text": "I’m actually feeling pretty energized! I finished that big history project last night so a huge weight is off my shoulders."},
{"speaker": "Keziah", "text": "I’m okay. Just here."},
{"speaker": "Leo", "text": "I’m hungry, mostly. Is there going to be a snack later? But otherwise, I’m good. Ready to see what we're doing today."},
{"speaker": "Sara", "text": "I'm a bit stressed. There's a lot of math homework piling up and I just feel like I'm sinking."},
{"speaker": "Sam", "text": "I don't know, I guess I'm fine. A bit skeptical about how much talking is going to help with my grades, but I'm here."},
{"speaker": "Fellow", "text": "I hear you, Sam. It’s fair to wonder how sitting in a circle helps with the ‘real world’ stuff like grades or football. And Sara, I totally feel that math stress—we’ve all been there where the pile of work looks more like a mountain. But hopefully, what we talk about today helps shift how we look at those mountains. Before we dive into the deep stuff, let's do a quick icebreaker. It's called 'The Impossible Task.' If you could suddenly be a master at one skill—something you’re currently terrible at—what would it be?"},
{"speaker": "Leo", "text": "Easy. Cooking. My mom says I can burn cereal. If I could just wake up and be a five-star chef, my life would be set. I'd make those massive platters of nyama choma every night."},
{"speaker": "Jabari", "text": "I’d want to be fluent in like, five languages. Imagine just traveling anywhere and knowing exactly what everyone is saying. No Google Translate needed."},
{"speaker": "Sara", "text": "I’d pick math. Obviously. I want to be one of those people who looks at a board of equations and just... sees the answer. Right now I just see scribbles."},
{"speaker": "Fellow", "text": "That’s a big one, Sara. The 'math person' myth is something we might actually bust today. What about you, Keziah? Any skill?"},
{"speaker": "Keziah", "text": "Maybe drawing? I see people in my class sketching these amazing portraits in their notebooks and I can’t even draw a straight line with a ruler."},
{"speaker": "Amani", "text": "I want to be a public speaker. Like the kind of person who stands on a stage and doesn't get sweaty palms or forget their name. I have all these ideas for the environmental club, but when I stand up, I just freeze."},
{"speaker": "Sam", "text": "This feels like a trick question. Even if I say I want to be a pro gamer or a billionaire, it’s not like it's going to happen overnight. You said 'master,' but mastery takes years, right?"},
{"speaker": "Fellow", "text": "You’re 100% right, Sam. Mastery does take years. But the interesting part isn’t the magic of waking up with the skill—it’s how we feel about the fact that we *don't* have it yet. That leads us right into our topic: Growth Mindset. Has anyone heard that term before?"},
{"speaker": "Amani", "text": "I think I saw a poster about it in the hallway? Something about your brain being a muscle?"},
{"speaker": "Fellow", "text": "Spot on, Amani. The core idea is simple: A growth mindset is the belief that our basic abilities—like intelligence, talent, or even that public speaking confidence—can be developed through dedication and hard work. It’s the opposite of a 'fixed mindset.'"},
{"speaker": "Leo", "text": "Wait, so you're saying I'm not just 'born' bad at cooking? Like, my brain can actually learn to not burn the cereal?"},
{"speaker": "Fellow", "text": "Exactly, Leo. A fixed mindset would say 'I'm just a bad cook, that’s who I am.' A growth mindset says 'I haven't learned the right temperature for the stove *yet*.' That little word—'yet'—is the most powerful word in this whole program."},
{"speaker": "Sam", "text": "I don’t know. Some people are just born smart. You see the kids who get straight A's without even trying. Then there’s people like me who study and still get a C. That feels pretty fixed to me."},
{"speaker": "Sara", "text": "I agree with Sam. I feel like my brain just isn't wired for numbers. No matter how much I 'grow' it, it's still going to struggle with calculus."},
{"speaker": "Fellow", "text": "I’m glad you brought that up, because it’s a really common frustration. It’s not that everyone has the exact same starting point—we don't. But the science shows that our brains are incredibly 'plastic.' When we practice something difficult, the neurons in our brain actually form new, stronger connections. It’s like a path in the woods. The first time you walk it, it’s overgrown and hard. But the more you walk it, the clearer and easier the path becomes."},
{"speaker": "Jabari", "text": "That actually makes sense with football. When I first started, I couldn't even dribble without looking at my feet. Now I don't even think about it. Is that the same thing?"},
{"speaker": "Fellow", "text": "Exactly the same thing, Jabari! You weren't born a football star. You built those neural pathways through thousands of repetitions. So, if we apply that to Sara’s math or Leo’s cooking, what changes?"},
{"speaker": "Sara", "text": "I guess... it means I'm not 'dumb' at math, I'm just on a path that's still really overgrown?"},
{"speaker": "Fellow", "text": "I love that image. It’s not a wall; it’s just a path that needs more walking. But let’s be real—walking through thorns is hard. Why do you think people get stuck in a fixed mindset? Why is it easier to just say 'I'm not good at this'?"},
{"speaker": "Keziah", "text": "Because it’s a good excuse. If I say I’m not an artist, then I don't have to feel bad when my drawing looks like a potato. If I say I'm trying and I still fail, that hurts more."},
{"speaker": "Amani", "text": "Yeah, it’s like protection. If you don’t try, you can’t really 'fail' at your full potential. You just failed because you didn't care."},
{"speaker": "Fellow", "text": "That’s a really deep insight, Keziah and Amani. Fixed mindset is often a shield we use to protect our ego. But what does that shield cost us in the long run?"},
{"speaker": "Leo", "text": "It costs us the nyama choma! I mean, it costs us the chance to actually get good at the stuff we want to do."},
{"speaker": "Jabari", "text": "It keeps you small. Like, if I stayed in a fixed mindset, I would have quit the team after the first week when the coach yelled at me for missing a tackle."},
{"speaker": "Sam", "text": "But what if the effort doesn't pay off? That’s my thing. I’ve seen people work really hard and still lose. The 'growth' doesn't always lead to a trophy."},
{"speaker": "Fellow", "text": "You’re right, Sam. Growth mindset isn't a magic wand that guarantees a win or an A+. It’s about the *process*. If you work hard and lose the game, a fixed mindset says 'I'm a loser.' A growth mindset says 'That game showed me that our defense needs work, and now I know what to practice tomorrow.' Which one of those people is going to be better next season?"},
{"speaker": "Sam", "text": "The second one, obviously. I see what you're saying. It's about how you handle the loss, not just avoiding the loss."},
{"speaker": "Fellow", "text": "Bingo. Let’s look at some real-life examples. Think of someone famous—an athlete, a scientist, a musician. Do you think they got there because of pure 'gift' or because of this growth approach? Let’s talk about Eliud Kipchoge. You all know him, right?"},
{"speaker": "Jabari", "text": "The GOAT! The marathon man."},
{"speaker": "Fellow", "text": "Exactly. Do you think he just woke up one day and ran a sub-two-hour marathon?"},
{"speaker": "Leo", "text": "No way. I saw a documentary. He lives in a training camp, sleeps on a simple bed, eats basic food, and runs miles every single day. He says 'No human is limited.'"},
{"speaker": "Fellow", "text": "'No human is limited.' That is the ultimate growth mindset slogan. But even Kipchoge has bad days. He’s lost races. When he loses, he doesn't say 'I guess I'm too old now,' he goes back to the camp and looks at his splits. How can we apply that 'Kipchoge energy' to something boring, like studying for a chemistry test?"},
{"speaker": "Sara", "text": "I guess instead of crying over the red marks on my paper—which I definitely did last week—I could look at *why* those marks are there? Like, did I misunderstand the formula or did I just rush through it?"},
{"speaker": "Fellow", "text": "That’s exactly it. Analyzing the mistake rather than wearing the mistake as an identity. Let’s try a little activity. I have some 'Fixed Mindset' phrases here, and I want you guys to help me 'translate' them into 'Growth Mindset' phrases. I’ll start with an easy one."},
{"speaker": "Fellow", "text": "Phrase 1: 'I'm just not a natural at this.' How do we flip that?"},
{"speaker": "Amani", "text": "'I'm still figuring out how this works, but I’m getting better with practice.'"},
{"speaker": "Fellow", "text": "Nice. Phrase 2: 'This is too hard, I give up.'"},
{"speaker": "Leo", "text": "'This is taking a lot of effort, so it must be making my brain stronger!' That sounds a bit cheesy, but it works."},
{"speaker": "Fellow", "text": "Cheese is okay! We like cheese. Okay, Phrase 3: 'She’s so much smarter than me, I’ll never be on her level.' This is a tough one because it involves comparing ourselves to others."},
{"speaker": "Keziah", "text": "Maybe... 'I wonder what study habits she uses that I could try?'"},
{"speaker": "Fellow", "text": "That is perfect, Keziah. Instead of being jealous, we use them as a map. Phrase 4: 'I made a mistake, I’m so embarrassed.'"},
{"speaker": "Sam", "text": "'I made a mistake, so now I know one way that doesn't work.' It’s like that Edison guy with the lightbulb. He didn't fail 1,000 times, he just found 1,000 ways not to make a bulb."},
{"speaker": "Fellow", "text": "Look at Sam with the history facts! Exactly. Now, I want you guys to think of a specific challenge you're facing right now. Don't say it out loud yet. Just think about it. Is it a subject in school? A relationship? A skill? Now, I want you to share—only if you're comfortable—what the 'Fixed' voice in your head is saying about that challenge, and then we as a group will help you find the 'Growth' translation."},
{"speaker": "Sara", "text": "I’ll go. My challenge is the math class. The fixed voice says: 'You’re going to fail the final, and everyone is going to know you’re the dumbest person in the grade.' It’s really loud and mean."},
{"speaker": "Fellow", "text": "Thank you for being so honest, Sara. That voice is a bully. Group, how do we help Sara talk back to that bully?"},
{"speaker": "Jabari", "text": "You could say, 'The final is a test of what I've learned, not a test of my value as a person.' And also, 'If I fail, it just means I need a different way of learning this material, like a tutor or a study group.'"},
{"speaker": "Amani", "text": "And Sara, you're literally one of the best writers I know. Maybe you can use your writing skills to explain the math problems to yourself in words? Like, tell the 'story' of the equation?"},
{"speaker": "Sara", "text": "Wait, I never thought of that. I actually like that idea. It makes it less about the cold numbers and more about the logic."},
{"speaker": "Fellow", "text": "See? That’s the power of the group. Amani just gave you a new path through the thorns. Who’s next?"},
{"speaker": "Leo", "text": "Mine is about my future. I want to go to university for engineering, but my grades in physics are... well, they aren't 'engineering' grades. My fixed voice says, 'Just pick something easier, you're aiming too high.'"},
{"speaker": "Sam", "text": "Leo, if you want to be an engineer, you're literally training to be a problem solver. So, treat the physics class like your first engineering project. The 'problem' is the grade, and the 'solution' is figuring out where the bridge is breaking. You wouldn't tell an engineer to just build a 'easier' bridge if the first one fell, right? They'd just fix the design."},
{"speaker": "Leo", "text": "Whoa. Sam, that was deep. I'm going to write that down. 'The physics class is my first project.'"},
{"speaker": "Fellow", "text": "Sam, you’re on fire today. That is exactly what a growth mindset looks like in the real world. It turns a threat into a project. Keziah, do you have one?"},
{"speaker": "Keziah", "text": "It's a bit different. I'm really shy, as you can probably tell. My fixed voice says, 'Don't even try to join the drama club, you'll just stutter and everyone will laugh and you'll be the girl who ruined the play.'"},
{"speaker": "Amani", "text": "Keziah, I feel the same way about the environmental club stuff. But what if the goal isn't to be 'perfect' on the first day? What if the goal is just to survive the first meeting?"},
{"speaker": "Fellow", "text": "That’s a great point. Growth mindset isn't always about being the best. Sometimes it's about being 1% braver than yesterday. Keziah, what would happen if you did stutter and people did notice? Would it be the end of the world, or would it just be 'data' for the next time?"},
{"speaker": "Keziah", "text": "I guess... it would just be proof that I was brave enough to try? It wouldn't kill me. It would just be awkward for a minute."},
{"speaker": "Fellow", "text": "Exactly. Growth happens in the 'discomfort zone.' If you're always comfortable, you're probably not growing. It's like lifting weights—if the weight is light, your muscles don't need to change. They only change when the weight is a little bit too heavy."},
{"speaker": "Jabari", "text": "I have one too. My fixed voice is about my injury. I twisted my ankle two weeks ago. The voice says, 'You’re losing your spot on the starting lineup. The other guys are getting ahead of you, and you’ll never catch up.' It makes me want to just stop doing my physical therapy because I feel like it’s useless."},
{"speaker": "Fellow", "text": "That’s a tough one because it’s physical, not just mental. But how does a growth mindset look at an injury?"},
{"speaker": "Leo", "text": "It’s a different kind of training. Like, maybe you can’t run right now, but you can study the game film? Or you can focus on strengthening your core? It’s not a 'stop,' it’s a 'detour.'"},
{"speaker": "Fellow", "text": "A detour! I love that. Jabari, you’re a football player who’s currently in 'recovery training' mode. That’s still being an athlete. It’s just a different phase of growth. How does that feel compared to 'I’m losing my spot'?"},
{"speaker": "Jabari", "text": "It feels less like a tragedy and more like a job I have to do. Like, my 'job' this week is just to do those boring ankle stretches so I can get back. It’s still progress, even if I’m not on the pitch."},
{"speaker": "Fellow", "text": "Perfect. Now, we’ve talked about how to change our internal voice. But how do we actually *do* it when things get really hard? Because it’s easy to talk about growth in this room, but it’s hard when you’re staring at a physics paper at 11 PM. I want to introduce a tool called 'The Power of Yet.' Whenever you find yourself making a 'Fixed' statement, I want you to mentally—or out loud—tack on the word 'yet.' 'I don't understand this... yet.' 'I'm not good at public speaking... yet.'"},
{"speaker": "Sam", "text": "It sounds almost too simple to work. Does adding one word really change your brain?"},
{"speaker": "Fellow", "text": "It doesn't change your brain instantly, but it changes your *perspective*. It opens a door that was closed. When you say 'I can't do this,' the door is slammed and locked. Your brain stops looking for solutions. When you say 'I can't do this *yet*,' the door stays cracked open. Your brain keeps scanning for a way through. It’s a signal to yourself that the story isn't over."},
{"speaker": "Amani", "text": "I'm going to use that for my speech prep. 'I'm not a confident speaker *yet*.' It makes me feel like I'm on a journey instead of just being stuck at a dead end."},
{"speaker": "Sara", "text": "I think I’m going to write 'YET' in big letters on the front of my math notebook. Every time I open it and feel that panic, I’ll see it."},
{"speaker": "Fellow", "text": "That is a brilliant idea, Sara. A visual reminder. So, we're coming toward the end of our time today, but I want to make sure we have a plan. Knowledge without action is just... well, it's just words. For this week, I have a small 'take-home' mission for you guys."},
{"speaker": "Leo", "text": "Is it cooking? Please let it be cooking practice."},
{"speaker": "Fellow", "text": "Haha, maybe for you, Leo! But for the group, the mission is this: I want you to identify one 'Growth Mindset' moment this week. A moment where you felt frustrated, or you felt like giving up, or you felt 'not good enough.' In that moment, I want you to use the word 'Yet' and then try one small thing to move forward. It could be asking a teacher a question, doing five minutes of practice, or just acknowledging that your brain is growing because the task is hard."},
{"speaker": "Sam", "text": "So we just have to notice it and say the word? No 10-page report?"},
{"speaker": "Fellow", "text": "No reports! Just notice and shift. And next week, we’ll start by sharing those 'Yet' moments. Even if the 'Yet' didn't lead to a total victory, I want to hear about the shift in how you felt."},
{"speaker": "Keziah", "text": "What if nothing 'hard' happens this week? What if it's just a normal week?"},
{"speaker": "Fellow", "text": "Great question. Growth mindset isn't just for big disasters. It's for the small things too. Maybe you're trying a new food, or trying to wake up five minutes earlier, or even just trying to have a conversation with someone new. Anytime you feel that little bit of 'I can't,' that's your 'Yet' opportunity."},
{"speaker": "Jabari", "text": "I'm going to use it for my rehab. Every time I want to skip the stretches because they're boring, I'm going to tell myself 'I'm not back on the field *yet*, but this is how I get there.'"},
{"speaker": "Fellow", "text": "Love that, Jabari. That’s the spirit. Before we wrap up, does anyone have any last questions or thoughts? Anything that still feels a bit confusing?"},
{"speaker": "Sara", "text": "I just want to say thanks. I felt really alone with the math stuff, like I was the only one who had a 'broken' brain. It helps to know that it's just a pathway I haven't cleared yet."},
{"speaker": "Fellow", "text": "You are definitely not alone, Sara. We’re all clearing paths. Some of us are hacking through jungles, and some of us are just sweeping off a sidewalk, but we’re all moving. Amani, Leo, Sam, Keziah, Jabari, Sara—you guys were awesome today. Your insights were so sharp, and I love how you supported each other. That’s what this group is about. We’re each other’s coaches."},
{"speaker": "Leo", "text": "Alright, I'm off to go not burn some rice. See you guys next week!"},
{"speaker": "Amani", "text": "See you later! Good luck with the math notebook, Sara."},
{"speaker": "Sara", "text": "Thanks! Good luck with the club meeting, Amani. You've got this!"},
{"speaker": "Sam", "text": "Yeah, see ya. I'll give this 'yet' thing a shot during my history quiz tomorrow."},
{"speaker": "Keziah", "text": "Bye everyone. Thanks."},
{"speaker": "Jabari", "text": "See you next time. Stay strong, everyone."},
{"speaker": "Fellow", "text": "Take care, everyone. Remember: your brain is a muscle. Give it a good workout this week! See you next Friday."}
]
}
